docs/howtowork.org
#+TITLE:    Org-mode 翻訳プロジェクト 翻訳手順
#+AUTHOR:   Takaaki ISHIKAWA
#+EMAIL:    takaxp@ieee.org
#+LANGUAGE: ja
#+STARTUP:  showall
#+TEXT:     全章を翻訳する本作業の手順を説明します．
#+TEXT:     Rev.1 (2011-09-18@14:05)
#+OPTIONS:  H:3 num:t toc:t \n:nil @:t ::t |:t ^:t *:t TeX:t
#+setupfile: theme-readtheorg.setup
#
* はじめに
Org-mode 翻訳プロジェクトは，Org-mode の公式マニュアルを日本語化することを目的にしています．公式マニュアルはPDFで200ページを超える分量が有り，4000を超える英文を日本語翻訳する必要があります．原文は，texinfo 形式で配布されていますが，今回の翻訳作業では，texinfo 形式を翻訳カタログに変換，po 形式のファイルを編集します．

po 形式のファイルは，
  - po-mode for Emacs (http://www.gnu.org/software/gettext/)
  - PoEdit (http://www.poedit.net/)
などのツールを利用して，効率良く編集することができます．プレーンテキストとして編集することもできますが，ツールの利用を推奨します．

翻訳作業は，原則として章ごとに翻訳担当者を割り当てて行ないます．翻訳者は，担当箇所をあらかじめ宣言することで他の翻訳者との作業の重複を避けます．そのために，github というソースコード管理を行うリポジトリ上において，翻訳箇所をチケットに区分してあります．翻訳者は登録されているチケットを担当することで翻訳する英文を宣言し，翻訳結果を github から取得した po 形式のファイルに書き込みます．翻訳が終了したら，翻訳済みの po 形式のファイルを，github のリポジトリに登録します．MLを使って提出することも可能です．

翻訳の結果の見栄えについては別途議論するので，特に気にせずに，ひたすら訳してください m(_ _)m

* 翻訳本作業の目的
  - PO 形式のすべての原文に翻訳文を割り当てる（翻訳率100％）
  - 翻訳内容の査読は別途行なうため，完全でなくてもよい
  - 用語集の完成
  - INFO／PDFの自動生成を阻害する翻訳作業の特定
* 既知の問題
** noindent 問題

@noindent で始まる行が，一部 PO ファイルに存在しない．po4a が以下のようなソースをPOファイルに変換しないのが原因．

@<pre>
@noindent Now byte-compile the Lisp files with the shell command:
@</pre>

本来，@noindent の直後には改行コードを入れ，

@<pre>
@noindent
Now byte-compile the Lisp files with the shell command:
@</pre>

とするのが正しい利用法であり，ソースがこの形式を守っている場合には，POファイルに正しく変換されている．

（see http://www.gnu.org/s/hello/manual/texinfo/noindent.html "since @noindent is a command used outside of paragraphs (see Command Syntax)."）

以下の40箇所のPOに存在しない原文は，査読作業を開始する時点で新しいPOTファイルを作成して対処する予定である．

@<pre>
   851:@noindent Now byte-compile the Lisp files with the shell command:
   857:@noindent If you are running Org from the distribution directory, this is
   899:@noindent Org mode buffers need font-lock to be turned on - this is the
   925:@noindent which will select Org-mode for this buffer no matter what
   936:@noindent If you do not like @code{transient-mark-mode}, you can create an
   964:@noindent which will put all this information into an Emacs mail buffer so
   977:@noindent Thank you for helping to improve this program.
  1105:@noindent Some people find the many stars too noisy and would prefer an
  1456:@noindent will define the key @kbd{C-c a f} as a shortcut for creating
  1782:@noindent The following command handles footnotes:
  1921:@noindent and then press @key{TAB} to align the table and start filling in
  2100:@noindent Then the only table command that still works is
  2346:@noindent Range references return a vector of values that can be fed
  2369:@noindent For the second example, table FOO must have at least as many rows
  2805:@noindent @b{Important}: please note that for these special tables,
  3033:@noindent In HTML export (@pxref{HTML export}), such targets will become
  3767:@noindent (you may also write @code{#+SEQ_TODO} to be explicit about the
  3783:@noindent To make sure you are using the correct keyword, type
  4295:@noindent The following commands work with checkboxes:
  4483:@noindent If the tag is only relevant to the file you are working on, then you
  4490:@noindent The tags interface will show the available tags in a splash
  4498:@noindent or write them in two lines:
  4513:@noindent you indicate that at most one of @samp{@@work}, @samp{@@home},
  4516:@noindent Don't forget to press @kbd{C-c C-c} with the cursor in one of
  5088:@noindent This dynamic block has the following parameters:
  5854:@noindent First there are options that determine which clock entries are to
  6162:@noindent and then customize the new variable with @kbd{M-x customize-variable org-capture-templates}, check the result, and save the
  6265:@noindent If you then press @kbd{C-c c t}, Org will prepare the template
  6310:@noindent If you do not define a template for the @kbd{C} key, this key will
  6527:@noindent The following commands deal with attachments:
  7092:@noindent After that, everything will happen automatically.  All diary
  8984:@noindent which can be referenced anywhere in the document (even in
  9096:@noindent With this setting, @samp{a_b} will not be interpreted as a
  9147:@noindent For example:
  9737:@noindent See the docstring of the variable
 14827:@noindent OK, now to the full list of contributions!  Again, please let me
@</pre>

** node 問題

node や ref に関連する一部の訳語は，info 生成時にエラーが発生するため，一時的に原文を採用している部分が存在します．

http://dl.dropbox.com/u/2440/2011/preservation-words.html

** po-mode での過剰なエスケープシーケンスの入力

見た目上のミスリードから生じる人為的問題です．

原文の表記に「For example, type @code{\"\\t\"} at the line.」とある場合，これを翻訳する時，PO-modeの編集画面で，
@<pre>
例えば，文中に@code{\"\\t"\}と入力する．<
@</pre>
と翻訳するのは，「誤り」です．

正解は，
@<pre>
例えば，文中に@code{"\t"}と入力する．<
@</pre>
になります．

PO-modeは，C-c C-cで編集モードを抜けるときに自動的にエスケープシーケンスを挿入するようです．上の誤りの例で翻訳すると，

@<pre>
例えば，文中に@code{\\\"\\\\t"\\\}と入力する．
@</pre>

という訳文が振られ，PDFでは \"\\t"\と表示されてしまいます（正しくは，\t）．

したがって，C-c C-c で編集モードを抜けた直後に，msgid と msgstr の表記を見比べて，余分なバックスラッシュが加わっていないかを確認してください．

** po-mode と PoEdit の差異により生じる問題

@<pre>
事象：PoEdit で保存できなくなる場合がある
原因：不要な改行コード「\n」
対処：msgidに \n がない場合は，msgstr でも改行しない．
@</pre>

PO-modeで編集する場合，

@<pre>
hoge1
<
@</pre>

の状態で保存すると，PoEdit側でエラーが出て保存できません．理由は，POファイルに

@<pre>
msgstr "hoge\n"
@</pre>

と保存されて，msgstr に \n が一つ多く含まれるためです．PoEdit では，msgid と msgstr に含まれる \n の数を検査しており，これが一致しないとエラーが出ます．

今回の場合は，
@<pre>
hoge1<
@</pre>
の状態で保存してください．一方，PoEditを利用している方は，\nを明示的に書き込まないと改行されません．つまり，
@<pre>
hoge1
hoge2
@</pre>
と入力し保存すると，
@<pre>
msgstr = "hoge1hoge2"
@</pre>
と書き込まれますので注意してください．

