docs/howtowork.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2018-10-27 Sat 07:51 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Org-mode 翻訳プロジェクト 翻訳手順</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Takaaki ISHIKAWA" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Org-mode 翻訳プロジェクト 翻訳手順</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd2bb70c">1. はじめに</a></li>
<li><a href="#org2bf3538">2. 翻訳本作業の目的</a></li>
<li><a href="#orga415f6a">3. 既知の問題</a>
<ul>
<li><a href="#orga166902">3.1. noindent 問題</a></li>
<li><a href="#orgae07c3d">3.2. node 問題</a></li>
<li><a href="#org370174f">3.3. po-mode での過剰なエスケープシーケンスの入力</a></li>
<li><a href="#org549ac0b">3.4. po-mode と PoEdit の差異により生じる問題</a></li>
</ul>
</li>
<li><a href="#org757bd61">4. 注意点（必ず読んでください！）</a>
<ul>
<li><a href="#org6e87fbd">4.1. github ユーザ</a></li>
<li><a href="#orgcf2e42d">4.2. po-mode ユーザ</a>
<ul>
<li><a href="#org2ebff39">4.2.1. 正しいヘッダ（翻訳日時と名前などは，通常，保存時に変更されます）</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8b07e04">5. 作業手順（github アカウントがない人）</a>
<ul>
<li><a href="#org619df47">5.1. 翻訳者用のメーリングリストに参加してください．</a></li>
<li><a href="#org5290b20">5.2. メンテナーにチケット予約を依頼する</a></li>
<li><a href="#org0e26fb1">5.3. github から翻訳リソースをダウンロードする</a></li>
<li><a href="#orgfa361a0">5.4. ダウンロードファイルの中の org-jp.po を開く</a></li>
<li><a href="#orgab49382">5.5. 翻訳箇所の特定</a>
<ul>
<li><a href="#org1d3bf5a">5.5.1. 例</a></li>
</ul>
</li>
<li><a href="#orgaefb2ef">5.6. 翻訳します</a></li>
<li><a href="#org00cdf41">5.7. データをチケット発行の代行をしたメンテナーに提出します．</a></li>
<li><a href="#orgdd67018">5.8. 用語集の更新</a>
<ul>
<li><a href="#orga5937e0">5.8.1. 例</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc493647">6. 作業手順（github アカウントがある人）</a>
<ul>
<li><a href="#orge2c7b3d">6.1. @takaxp に org-mode-doc-ja への参加を依頼します．</a></li>
<li><a href="#org12ea104">6.2. 発行済みチケットの担当を宣言します．</a></li>
<li><a href="#org31ccb49">6.3. リポジトリを入手します．</a></li>
<li><a href="#org7721185">6.4. ダウンロードファイルの中の org-jp.po を開く</a></li>
<li><a href="#org22d75f7">6.5. チケットで指定された訳文番号を探します．</a></li>
<li><a href="#orgb9dab54">6.6. 翻訳します</a></li>
<li><a href="#org5919adb">6.7. 用語集の更新</a></li>
<li><a href="#org9f19e13">6.8. 翻訳データを登録します</a>
<ul>
<li><a href="#orgd1e535e">6.8.1. 翻訳データを登録します（コンフリクト経験が浅い方）</a></li>
<li><a href="#org1f0ef62">6.8.2. 翻訳データを登録します（自力で何とかできる方）</a></li>
</ul>
</li>
<li><a href="#orgaf8e6aa">6.9. github で登録した情報を確認します．</a>
<ul>
<li><a href="#org28d0615">6.9.1. 登録ミスに気付いた場合</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
#+READONLY
</p>
<div id="outline-container-orgd2bb70c" class="outline-2">
<h2 id="orgd2bb70c"><span class="section-number-2">1</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
<p>
Org-mode 翻訳プロジェクトは，Org-mode の公式マニュアルを日本語化することを目的にしています．公式マニュアルはPDFで200ページを超える分量が有り，4000を超える英文を日本語翻訳する必要があります．原文は，texinfo 形式で配布されていますが，今回の翻訳作業では，texinfo 形式を翻訳カタログに変換，po 形式のファイルを編集します．
</p>

<p>
po 形式のファイルは，
</p>
<ul class="org-ul">
<li>po-mode for Emacs (<a href="http://www.gnu.org/software/gettext/">http://www.gnu.org/software/gettext/</a>)</li>
<li>PoEdit (<a href="http://www.poedit.net/">http://www.poedit.net/</a>)</li>
</ul>
<p>
などのツールを利用して，効率良く編集することができます．プレーンテキストとして編集することもできますが，ツールの利用を推奨します．
</p>

<p>
翻訳作業は，原則として章ごとに翻訳担当者を割り当てて行ないます．翻訳者は，担当箇所をあらかじめ宣言することで他の翻訳者との作業の重複を避けます．そのために，github というソースコード管理を行うリポジトリ上において，翻訳箇所をチケットに区分してあります．翻訳者は登録されているチケットを担当することで翻訳する英文を宣言し，翻訳結果を github から取得した po 形式のファイルに書き込みます．翻訳が終了したら，翻訳済みの po 形式のファイルを，github のリポジトリに登録します．MLを使って提出することも可能です．
</p>

<p>
翻訳の結果の見栄えについては別途議論するので，特に気にせずに，ひたすら訳してください m(_ _)m
</p>
</div>
</div>

<div id="outline-container-org2bf3538" class="outline-2">
<h2 id="org2bf3538"><span class="section-number-2">2</span> 翻訳本作業の目的</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>PO 形式のすべての原文に翻訳文を割り当てる（翻訳率100％）</li>
<li>翻訳内容の査読は別途行なうため，完全でなくてもよい</li>
<li>用語集の完成</li>
<li>INFO／PDFの自動生成を阻害する翻訳作業の特定</li>
</ul>
</div>
</div>
<div id="outline-container-orga415f6a" class="outline-2">
<h2 id="orga415f6a"><span class="section-number-2">3</span> 既知の問題</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orga166902" class="outline-3">
<h3 id="orga166902"><span class="section-number-3">3.1</span> noindent 問題</h3>
<div class="outline-text-3" id="text-3-1">
<p>
@noindent で始まる行が，一部 PO ファイルに存在しない．po4a が以下のようなソースをPOファイルに変換しないのが原因．
</p>

<p>
@&lt;pre&gt;
@noindent Now byte-compile the Lisp files with the shell command:
@&lt;/pre&gt;
</p>

<p>
本来，@noindent の直後には改行コードを入れ，
</p>

<p>
@&lt;pre&gt;
@noindent
Now byte-compile the Lisp files with the shell command:
@&lt;/pre&gt;
</p>

<p>
とするのが正しい利用法であり，ソースがこの形式を守っている場合には，POファイルに正しく変換されている．
</p>

<p>
（see <a href="http://www.gnu.org/s/hello/manual/texinfo/noindent.html">http://www.gnu.org/s/hello/manual/texinfo/noindent.html</a> "since @noindent is a command used outside of paragraphs (see Command Syntax)."）
</p>

<p>
以下の40箇所のPOに存在しない原文は，査読作業を開始する時点で新しいPOTファイルを作成して対処する予定である．
</p>

<p>
@&lt;pre&gt;
   851:@noindent Now byte-compile the Lisp files with the shell command:
   857:@noindent If you are running Org from the distribution directory, this is
   899:@noindent Org mode buffers need font-lock to be turned on - this is the
   925:@noindent which will select Org-mode for this buffer no matter what
   936:@noindent If you do not like @code{transient-mark-mode}, you can create an
   964:@noindent which will put all this information into an Emacs mail buffer so
   977:@noindent Thank you for helping to improve this program.
  1105:@noindent Some people find the many stars too noisy and would prefer an
  1456:@noindent will define the key @kbd{C-c a f} as a shortcut for creating
  1782:@noindent The following command handles footnotes:
  1921:@noindent and then press @key{TAB} to align the table and start filling in
  2100:@noindent Then the only table command that still works is
  2346:@noindent Range references return a vector of values that can be fed
  2369:@noindent For the second example, table FOO must have at least as many rows
  2805:@noindent @b{Important}: please note that for these special tables,
  3033:@noindent In HTML export (@pxref{HTML export}), such targets will become
  3767:@noindent (you may also write @code{#+SEQ<sub>TODO</sub>} to be explicit about the
  3783:@noindent To make sure you are using the correct keyword, type
  4295:@noindent The following commands work with checkboxes:
  4483:@noindent If the tag is only relevant to the file you are working on, then you
  4490:@noindent The tags interface will show the available tags in a splash
  4498:@noindent or write them in two lines:
  4513:@noindent you indicate that at most one of @samp{@@work}, @samp{@@home},
  4516:@noindent Don't forget to press @kbd{C-c C-c} with the cursor in one of
  5088:@noindent This dynamic block has the following parameters:
  5854:@noindent First there are options that determine which clock entries are to
  6162:@noindent and then customize the new variable with @kbd{M-x customize-variable org-capture-templates}, check the result, and save the
  6265:@noindent If you then press @kbd{C-c c t}, Org will prepare the template
  6310:@noindent If you do not define a template for the @kbd{C} key, this key will
  6527:@noindent The following commands deal with attachments:
  7092:@noindent After that, everything will happen automatically.  All diary
  8984:@noindent which can be referenced anywhere in the document (even in
  9096:@noindent With this setting, @samp{a<sub>b</sub>} will not be interpreted as a
  9147:@noindent For example:
  9737:@noindent See the docstring of the variable
 14827:@noindent OK, now to the full list of contributions!  Again, please let me
@&lt;/pre&gt;
</p>
</div>
</div>

<div id="outline-container-orgae07c3d" class="outline-3">
<h3 id="orgae07c3d"><span class="section-number-3">3.2</span> node 問題</h3>
<div class="outline-text-3" id="text-3-2">
<p>
node や ref に関連する一部の訳語は，info 生成時にエラーが発生するため，一時的に原文を採用している部分が存在します．
</p>

<p>
<a href="http://dl.dropbox.com/u/2440/2011/preservation-words.html">http://dl.dropbox.com/u/2440/2011/preservation-words.html</a>
</p>
</div>
</div>

<div id="outline-container-org370174f" class="outline-3">
<h3 id="org370174f"><span class="section-number-3">3.3</span> po-mode での過剰なエスケープシーケンスの入力</h3>
<div class="outline-text-3" id="text-3-3">
<p>
見た目上のミスリードから生じる人為的問題です．
</p>

<p>
原文の表記に「For example, type @code{\"\\t\"} at the line.」とある場合，これを翻訳する時，PO-modeの編集画面で，
@&lt;pre&gt;
例えば，文中に@code{\"\\t"\}と入力する．&lt;
@&lt;/pre&gt;
と翻訳するのは，「誤り」です．
</p>

<p>
正解は，
@&lt;pre&gt;
例えば，文中に@code{"\t"}と入力する．&lt;
@&lt;/pre&gt;
になります．
</p>

<p>
PO-modeは，C-c C-cで編集モードを抜けるときに自動的にエスケープシーケンスを挿入するようです．上の誤りの例で翻訳すると，
</p>

<p>
@&lt;pre&gt;
例えば，文中に@code{\\\"\\\\t"\\\}と入力する．
@&lt;/pre&gt;
</p>

<p>
という訳文が振られ，PDFでは \"\\t"\と表示されてしまいます（正しくは，\t）．
</p>

<p>
したがって，C-c C-c で編集モードを抜けた直後に，msgid と msgstr の表記を見比べて，余分なバックスラッシュが加わっていないかを確認してください．
</p>
</div>
</div>

<div id="outline-container-org549ac0b" class="outline-3">
<h3 id="org549ac0b"><span class="section-number-3">3.4</span> po-mode と PoEdit の差異により生じる問題</h3>
<div class="outline-text-3" id="text-3-4">
<p>
@&lt;pre&gt;
事象：PoEdit で保存できなくなる場合がある
原因：不要な改行コード「\n」
対処：msgidに \n がない場合は，msgstr でも改行しない．
@&lt;/pre&gt;
</p>

<p>
PO-modeで編集する場合，
</p>

<p>
@&lt;pre&gt;
hoge1
&lt;
@&lt;/pre&gt;
</p>

<p>
の状態で保存すると，PoEdit側でエラーが出て保存できません．理由は，POファイルに
</p>

<p>
@&lt;pre&gt;
msgstr "hoge\n"
@&lt;/pre&gt;
</p>

<p>
と保存されて，msgstr に \n が一つ多く含まれるためです．PoEdit では，msgid と msgstr に含まれる \n の数を検査しており，これが一致しないとエラーが出ます．
</p>

<p>
今回の場合は，
@&lt;pre&gt;
hoge1&lt;
@&lt;/pre&gt;
の状態で保存してください．一方，PoEditを利用している方は，\nを明示的に書き込まないと改行されません．つまり，
@&lt;pre&gt;
hoge1
hoge2
@&lt;/pre&gt;
と入力し保存すると，
@&lt;pre&gt;
msgstr = "hoge1hoge2"
@&lt;/pre&gt;
と書き込まれますので注意してください．
</p>
</div>
</div>
</div>
