docs/howtowork.org
* 注意点（必ず読んでください！）
  - スタイルガイドを読んでから翻訳作業を開始してください．
	http://dl.dropbox.com/u/2440/2011/style.html
  - 用語集の更新を心がけてください．
	頻繁に更新されれば，他のメンバーのダブルワークを防ぐことができます．個人の翻訳用語集に新しい用語，もしくは，修正対象とする用語を登録したら，「すみやかに commit/push」してください．
  - UTF-8 を利用してください．
	別のコードを使う場合は，github にコミットせず，MLに提出してください．
  - 改行コードはLFにしてください．
	別のコードを使う場合は，github にコミットせず，MLに提出してください．
  - 対訳に半角スペースを入れないでください．
  - texinfo の制御文は残してください．
	どれが制御文かはあえて明示しません．これは，INFO自動生成時に問題になる
	ところを今回のプレテストで知るためです．ミスして訳しても全く問題ありません！
	ただし，typo に注意してください．
  - 翻訳は，4.6版の訳を積極的に参照してください．
	未公開のwikiで入手可能なので，#org2ja で聞いて下さい．
  - 翻訳中に気付いたことは，担当チケットのコメント欄に記入してください．
  - 基本は「ですます調」で訳してください．
	ただし，「である調（〜する．〜と書く．など）」が相応しい場合（箇条書きの中やコマンドの説明など）には，翻訳者の判断で「である調」を使用してください．
  - 改行コードの有無に気を付けてください

** github ユーザ
  - 翻訳プロジェクトに参加したら，すみやかに git clone でデータを取り寄せてください．
 => ダウンロードによるデータの取り寄せは行わないでください．
  - git clone で入手した org-ja.po を編集（翻訳）してください．
  - git push（コミット）後は，github のウェブサイトで差分を確認してください．

** po-mode ユーザ
  - po ファイルを編集する時に，余計なヘッダが加わる場合があります．
	コミットする前に必ず重複ヘッダを削除してください．
  - MacPorts で配布されている po-mode.el は，version2.1です．
	gettext で配布される po-mode.el は，version2.2ですので，こちらを推奨します．
	http://www.gnu.org/software/gettext/
*** 正しいヘッダ（翻訳日時と名前などは，通常，保存時に変更されます）
@<pre>
	# SOME DESCRIPTIVE TITLE
	# Copyright (C) YEAR Free Software Foundation, Inc.
	# This file is distributed under the same license as the PACKAGE package.
	# FIRST AUTHOR <EMAIL@ADDRESS>, YEAR.
	#
	msgid ""
	msgstr ""
	"Project-Id-Version: org-ja\n"
	"POT-Creation-Date: 2011-04-20 21:27+0900\n"
	"PO-Revision-Date: 2011-04-24 18:19+0900\n"
	"Last-Translator: Takaaki ISHIKAWA <takaxp@ieee.org>\n"
	"Language-Team: org-mode-doc-ja <org2ja-users@lists.sourceforge.net>\n"
	"Language: \n"
	"MIME-Version: 1.0\n"
	"Content-Type: text/plain; charset=UTF-8\n"
	"Content-Transfer-Encoding: 8bit\n"
	"X-Poedit-Language: Japanese\n"
	"X-Poedit-Country: JAPAN\n"
	"X-Poedit-SourceCharset: utf-8\n"
	"X-Poedit-Basepath: .\n"
	"X-Poedit-SearchPath-0: .\n"
@</pre>
* 作業手順（github アカウントがない人）
** 翻訳者用のメーリングリストに参加してください．
  - 登録依頼を出すと，参加承認が下り次第，連絡がいきます．
https://lists.sourceforge.net/lists/listinfo/org2ja-devel
にて登録を済ませてください．
** メンテナーにチケット予約を依頼する
  - Twitter でハッシュタグ（#org2ja）を利用してツイートする．
	 => メンテナーは，すみやかに自分のアカウントでチケットを予約して，
	 => 翻訳者に報告する
  - 合せてMLでも依頼するとより確実に伝わります．
24時間以内に応答がない場合は，依頼のチェックミスがあったと考えられますので，再投稿をお願いします．	
** github から翻訳リソースをダウンロードする
	次のサイトの画面右側に「Downloads」があります．
	https://github.com/org-mode-doc-ja/org-ja
** ダウンロードファイルの中の org-jp.po を開く
  - 翻訳ツールの利用を推奨します．
  - 通常のテキストエディタでもいけます
** 翻訳箇所の特定
1. org.texi 上で，@chapter を検索し行番号を抽出します．
2. PO 上でその行番号を有するブロックを探索します．
*** 例
@chapter Working with source code を，org.texi 上で検索すると，11210行目に存在します．PO上のブロックがこの行数以降の行数を有していれば，翻訳対象になります．具体的には，

@<pre>
	#. type: cindex
	#: org.texi:11211
	#, no-wrap
	msgid "Schulte, Eric"
	msgstr ""
@</pre>
が最初の翻訳対象となります．#: org.texi:11211 (>11210)になっています．

一度翻訳開始箇所がわかると，後は昇順になっていますので，連続して作業できます．どこまで翻訳作業をすすめればよいかは，次の章を@chapterで探索して，同様に行数を調べれば特定可能です．

** 翻訳します
  - 英語文は，msgid "hogehoge" と書かれているので，msgstr "ほげほげ" と
	訳文を記入して保存します．
  - 改行コードに気を付けてください．
	msgid "hoge\nhoge\n" であるならば，msgstr "ほげ\nほげ\n"が正しい翻訳です．
  - 翻訳時には，このファイルに記載された「注意点」に気をつけてください．
  - POファイルに埋め込まれた用語集を参照してください．
** データをチケット発行の代行をしたメンテナーに提出します．
  - MLに翻訳を終えた org-ja.po を提出します．
  - 翻訳データは特に圧縮しなくてもMLに投げられるようになっています．
  - 該当部分だけをメール本文にコピペしても構いません．
** 用語集の更新
  - 翻訳過程で，特定の用語について訳語を統一したい場合，MLに報告してください．
  - POファイルに埋め込まれた用語集について，異なる訳語を当てはめたい場合についても同様に報告してください．
  - ML報告形式は以下のようなテンプレートにしたがってください．

@<pre>
メールタイトル: [glossary] 用語
本文:
用語（タブ）訳語1|訳語2 // 旧対訳
-- -- -- -- -- -- -- -- -- -- -- -- 
用語（タブ）訳語1|訳語2 // 修正案
コメント）修正理由などを書く
@</pre>

*** 例
@<pre>
Subject: [glossary] prefix
prefix	prefix
prefix arg	prefix
prefix argment	prefix
-- -- -- -- -- -- -- -- -- -- -- -- 
prefix	プレフィックス
prefix arg	プレフィックス
prefix argment	プレフィックス
コメント）好みの問題かもしれない．他の方の意見も欲しい．
@</pre>

@<pre>
toggle	切り替える|トグル	どう訳したら良いか悩む。
-- -- -- -- -- -- -- -- -- -- -- -- 
toggle	トグル|切り替える
コメント）トグルするで通用すると思うが，
読者に優しいのかは分かりません．．．
他の方のご意見募集．
@</pre>

@<pre>
context	状況|文脈
-- -- -- -- -- -- -- -- -- -- -- -- 
context	コンテクスト|状況|文脈
コメント）TODOアイテムと関連してGTDの用語として
出てくることが多いようです．カタカナ訳がより
好ましいと思います．
@</pre>

* 作業手順（github アカウントがある人）
** @takaxp に org-mode-doc-ja への参加を依頼します．
  - github のアカウントをDMなどで教えてください．
  - 合せてMLにも参加してください．
https://lists.sourceforge.net/lists/listinfo/org2ja-devel
にて登録を済ませてください．
** 発行済みチケットの担当を宣言します．
  - githubのチケット一覧から，OPENかつ担当者がアサインされていないものを選びます．
チケットの名称は，基本的に，章番号＋章タイトルになっています．クリックするとチケットの詳細画面がでます．その中の右側で緑色の「OPEN」があれば，翻訳が完了していないチケットです．さらに，タイトル下に「No one is assigned」があれば，担当者がいません．
 => このプルダウンで，自分のアカウントを選択すれば担当完了です．

https://github.com/org-mode-doc-ja/org-ja/issues/
** リポジトリを入手します．
	git clone git@github.com:org-mode-doc-ja/org-ja.git
** ダウンロードファイルの中の org-jp.po を開く
 =>	作業手順（github アカウントがない人）と同じです．
** チケットで指定された訳文番号を探します．
 =>	作業手順（github アカウントがない人）と同じです．
** 翻訳します
 =>	作業手順（github アカウントがない人）と同じです．
** 用語集の更新
 =>	作業手順（github アカウントがない人）と同じです．ただし，github ユーザには，用語集を申請する特別なファイルがあります．新しい用語集を申請する時は，MLへの報告以外に，このファイルへ書き込むことでもOKです．メンテナーがプロジェクト全体の用語集に反映します．

@hoge がユーザの場合，./glossary/hoge.txt を利用してください．

** 翻訳データを登録します
