docs/howtowork.html

<div id="outline-container-org757bd61" class="outline-2">
<h2 id="org757bd61"><span class="section-number-2">4</span> 注意点（必ず読んでください！）</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>スタイルガイドを読んでから翻訳作業を開始してください．</li>
</ul>
<p>
<a href="http://dl.dropbox.com/u/2440/2011/style.html">http://dl.dropbox.com/u/2440/2011/style.html</a>
</p>
<ul class="org-ul">
<li>用語集の更新を心がけてください．</li>
</ul>
<p>
頻繁に更新されれば，他のメンバーのダブルワークを防ぐことができます．個人の翻訳用語集に新しい用語，もしくは，修正対象とする用語を登録したら，「すみやかに commit/push」してください．
</p>
<ul class="org-ul">
<li>UTF-8 を利用してください．</li>
</ul>
<p>
別のコードを使う場合は，github にコミットせず，MLに提出してください．
</p>
<ul class="org-ul">
<li>改行コードはLFにしてください．</li>
</ul>
<p>
別のコードを使う場合は，github にコミットせず，MLに提出してください．
</p>
<ul class="org-ul">
<li>対訳に半角スペースを入れないでください．</li>
<li>texinfo の制御文は残してください．</li>
</ul>
<p>
どれが制御文かはあえて明示しません．これは，INFO自動生成時に問題になる
ところを今回のプレテストで知るためです．ミスして訳しても全く問題ありません！
ただし，typo に注意してください．
</p>
<ul class="org-ul">
<li>翻訳は，4.6版の訳を積極的に参照してください．</li>
</ul>
<p>
未公開のwikiで入手可能なので，#org2ja で聞いて下さい．
</p>
<ul class="org-ul">
<li>翻訳中に気付いたことは，担当チケットのコメント欄に記入してください．</li>
<li>基本は「ですます調」で訳してください．</li>
</ul>
<p>
ただし，「である調（〜する．〜と書く．など）」が相応しい場合（箇条書きの中やコマンドの説明など）には，翻訳者の判断で「である調」を使用してください．
</p>
<ul class="org-ul">
<li>改行コードの有無に気を付けてください</li>
</ul>
</div>

<div id="outline-container-org6e87fbd" class="outline-3">
<h3 id="org6e87fbd"><span class="section-number-3">4.1</span> github ユーザ</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>翻訳プロジェクトに参加したら，すみやかに git clone でデータを取り寄せてください．</li>
</ul>
<p>
=&gt; ダウンロードによるデータの取り寄せは行わないでください．
</p>
<ul class="org-ul">
<li>git clone で入手した org-ja.po を編集（翻訳）してください．</li>
<li>git push（コミット）後は，github のウェブサイトで差分を確認してください．</li>
</ul>
</div>
</div>

<div id="outline-container-orgcf2e42d" class="outline-3">
<h3 id="orgcf2e42d"><span class="section-number-3">4.2</span> po-mode ユーザ</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>po ファイルを編集する時に，余計なヘッダが加わる場合があります．</li>
</ul>
<p>
コミットする前に必ず重複ヘッダを削除してください．
</p>
<ul class="org-ul">
<li>MacPorts で配布されている po-mode.el は，version2.1です．</li>
</ul>
<p>
gettext で配布される po-mode.el は，version2.2ですので，こちらを推奨します．
<a href="http://www.gnu.org/software/gettext/">http://www.gnu.org/software/gettext/</a>
</p>
</div>
<div id="outline-container-org2ebff39" class="outline-4">
<h4 id="org2ebff39"><span class="section-number-4">4.2.1</span> 正しいヘッダ（翻訳日時と名前などは，通常，保存時に変更されます）</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
@&lt;pre&gt;
</p>

<p>
	msgid ""
	msgstr ""
	"Project-Id-Version: org-ja\n"
	"POT-Creation-Date: 2011-04-20 21:27+0900\n"
	"PO-Revision-Date: 2011-04-24 18:19+0900\n"
	"Last-Translator: Takaaki ISHIKAWA &lt;takaxp@ieee.org&gt;\n"
	"Language-Team: org-mode-doc-ja &lt;org2ja-users@lists.sourceforge.net&gt;\n"
	"Language: \n"
	"MIME-Version: 1.0\n"
	"Content-Type: text/plain; charset=UTF-8\n"
	"Content-Transfer-Encoding: 8bit\n"
	"X-Poedit-Language: Japanese\n"
	"X-Poedit-Country: JAPAN\n"
	"X-Poedit-SourceCharset: utf-8\n"
	"X-Poedit-Basepath: .\n"
	"X-Poedit-SearchPath-0: .\n"
@&lt;/pre&gt;
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org8b07e04" class="outline-2">
<h2 id="org8b07e04"><span class="section-number-2">5</span> 作業手順（github アカウントがない人）</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org619df47" class="outline-3">
<h3 id="org619df47"><span class="section-number-3">5.1</span> 翻訳者用のメーリングリストに参加してください．</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>登録依頼を出すと，参加承認が下り次第，連絡がいきます．</li>
</ul>
<p>
<a href="https://lists.sourceforge.net/lists/listinfo/org2ja-devel">https://lists.sourceforge.net/lists/listinfo/org2ja-devel</a>
にて登録を済ませてください．
</p>
</div>
</div>
<div id="outline-container-org5290b20" class="outline-3">
<h3 id="org5290b20"><span class="section-number-3">5.2</span> メンテナーにチケット予約を依頼する</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>Twitter でハッシュタグ（#org2ja）を利用してツイートする．
=&gt; メンテナーは，すみやかに自分のアカウントでチケットを予約して，
=&gt; 翻訳者に報告する</li>
<li>合せてMLでも依頼するとより確実に伝わります．</li>
</ul>
<p>
24時間以内に応答がない場合は，依頼のチェックミスがあったと考えられますので，再投稿をお願いします．	
</p>
</div>
</div>
<div id="outline-container-org0e26fb1" class="outline-3">
<h3 id="org0e26fb1"><span class="section-number-3">5.3</span> github から翻訳リソースをダウンロードする</h3>
<div class="outline-text-3" id="text-5-3">
<p>
次のサイトの画面右側に「Downloads」があります．
<a href="https://github.com/org-mode-doc-ja/org-ja">https://github.com/org-mode-doc-ja/org-ja</a>
</p>
</div>
</div>
<div id="outline-container-orgfa361a0" class="outline-3">
<h3 id="orgfa361a0"><span class="section-number-3">5.4</span> ダウンロードファイルの中の org-jp.po を開く</h3>
<div class="outline-text-3" id="text-5-4">
<ul class="org-ul">
<li>翻訳ツールの利用を推奨します．</li>
<li>通常のテキストエディタでもいけます</li>
</ul>
</div>
</div>
<div id="outline-container-orgab49382" class="outline-3">
<h3 id="orgab49382"><span class="section-number-3">5.5</span> 翻訳箇所の特定</h3>
<div class="outline-text-3" id="text-5-5">
<ol class="org-ol">
<li>org.texi 上で，@chapter を検索し行番号を抽出します．</li>
<li>PO 上でその行番号を有するブロックを探索します．</li>
</ol>
</div>
<div id="outline-container-org1d3bf5a" class="outline-4">
<h4 id="org1d3bf5a"><span class="section-number-4">5.5.1</span> 例</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
@chapter Working with source code を，org.texi 上で検索すると，11210行目に存在します．PO上のブロックがこの行数以降の行数を有していれば，翻訳対象になります．具体的には，
</p>

<p>
@&lt;pre&gt;
	#. type: cindex
	#: org.texi:11211
	#, no-wrap
	msgid "Schulte, Eric"
	msgstr ""
@&lt;/pre&gt;
が最初の翻訳対象となります．#: org.texi:11211 (&gt;11210)になっています．
</p>

<p>
一度翻訳開始箇所がわかると，後は昇順になっていますので，連続して作業できます．どこまで翻訳作業をすすめればよいかは，次の章を@chapterで探索して，同様に行数を調べれば特定可能です．
</p>
</div>
</div>
</div>

<div id="outline-container-orgaefb2ef" class="outline-3">
<h3 id="orgaefb2ef"><span class="section-number-3">5.6</span> 翻訳します</h3>
<div class="outline-text-3" id="text-5-6">
<ul class="org-ul">
<li>英語文は，msgid "hogehoge" と書かれているので，msgstr "ほげほげ" と</li>
</ul>
<p>
訳文を記入して保存します．
</p>
<ul class="org-ul">
<li>改行コードに気を付けてください．</li>
</ul>
<p>
msgid "hoge\nhoge\n" であるならば，msgstr "ほげ\nほげ\n"が正しい翻訳です．
</p>
<ul class="org-ul">
<li>翻訳時には，このファイルに記載された「注意点」に気をつけてください．</li>
<li>POファイルに埋め込まれた用語集を参照してください．</li>
</ul>
</div>
</div>
<div id="outline-container-org00cdf41" class="outline-3">
<h3 id="org00cdf41"><span class="section-number-3">5.7</span> データをチケット発行の代行をしたメンテナーに提出します．</h3>
<div class="outline-text-3" id="text-5-7">
<ul class="org-ul">
<li>MLに翻訳を終えた org-ja.po を提出します．</li>
<li>翻訳データは特に圧縮しなくてもMLに投げられるようになっています．</li>
<li>該当部分だけをメール本文にコピペしても構いません．</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd67018" class="outline-3">
<h3 id="orgdd67018"><span class="section-number-3">5.8</span> 用語集の更新</h3>
<div class="outline-text-3" id="text-5-8">
<ul class="org-ul">
<li>翻訳過程で，特定の用語について訳語を統一したい場合，MLに報告してください．</li>
<li>POファイルに埋め込まれた用語集について，異なる訳語を当てはめたい場合についても同様に報告してください．</li>
<li>ML報告形式は以下のようなテンプレートにしたがってください．</li>
</ul>

<p>
@&lt;pre&gt;
メールタイトル: [glossary] 用語
本文:
用語（タブ）訳語1|訳語2 // 旧対訳
&#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; 
用語（タブ）訳語1|訳語2 // 修正案
コメント）修正理由などを書く
@&lt;/pre&gt;
</p>
</div>

<div id="outline-container-orga5937e0" class="outline-4">
<h4 id="orga5937e0"><span class="section-number-4">5.8.1</span> 例</h4>
<div class="outline-text-4" id="text-5-8-1">
<p>
@&lt;pre&gt;
Subject: [glossary] prefix
prefix	prefix
prefix arg	prefix
prefix argment	prefix
&#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; 
prefix	プレフィックス
prefix arg	プレフィックス
prefix argment	プレフィックス
コメント）好みの問題かもしれない．他の方の意見も欲しい．
@&lt;/pre&gt;
</p>

<p>
@&lt;pre&gt;
toggle	切り替える|トグル	どう訳したら良いか悩む。
&#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; 
toggle	トグル|切り替える
コメント）トグルするで通用すると思うが，
読者に優しいのかは分かりません．．．
他の方のご意見募集．
@&lt;/pre&gt;
</p>

<p>
@&lt;pre&gt;
context	状況|文脈
&#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; &#x2013; 
context	コンテクスト|状況|文脈
コメント）TODOアイテムと関連してGTDの用語として
出てくることが多いようです．カタカナ訳がより
好ましいと思います．
@&lt;/pre&gt;
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc493647" class="outline-2">
<h2 id="orgc493647"><span class="section-number-2">6</span> 作業手順（github アカウントがある人）</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge2c7b3d" class="outline-3">
<h3 id="orge2c7b3d"><span class="section-number-3">6.1</span> @takaxp に org-mode-doc-ja への参加を依頼します．</h3>
<div class="outline-text-3" id="text-6-1">
<ul class="org-ul">
<li>github のアカウントをDMなどで教えてください．</li>
<li>合せてMLにも参加してください．</li>
</ul>
<p>
<a href="https://lists.sourceforge.net/lists/listinfo/org2ja-devel">https://lists.sourceforge.net/lists/listinfo/org2ja-devel</a>
にて登録を済ませてください．
</p>
</div>
</div>
<div id="outline-container-org12ea104" class="outline-3">
<h3 id="org12ea104"><span class="section-number-3">6.2</span> 発行済みチケットの担当を宣言します．</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>githubのチケット一覧から，OPENかつ担当者がアサインされていないものを選びます．</li>
</ul>
<p>
チケットの名称は，基本的に，章番号＋章タイトルになっています．クリックするとチケットの詳細画面がでます．その中の右側で緑色の「OPEN」があれば，翻訳が完了していないチケットです．さらに，タイトル下に「No one is assigned」があれば，担当者がいません．
 =&gt; このプルダウンで，自分のアカウントを選択すれば担当完了です．
</p>

<p>
<a href="https://github.com/org-mode-doc-ja/org-ja/issues/">https://github.com/org-mode-doc-ja/org-ja/issues/</a>
</p>
</div>
</div>
<div id="outline-container-org31ccb49" class="outline-3">
<h3 id="org31ccb49"><span class="section-number-3">6.3</span> リポジトリを入手します．</h3>
<div class="outline-text-3" id="text-6-3">
<p>
git clone git@github.com:org-mode-doc-ja/org-ja.git
</p>
</div>
</div>
<div id="outline-container-org7721185" class="outline-3">
<h3 id="org7721185"><span class="section-number-3">6.4</span> ダウンロードファイルの中の org-jp.po を開く</h3>
<div class="outline-text-3" id="text-6-4">
<p>
=&gt;	作業手順（github アカウントがない人）と同じです．
</p>
</div>
</div>
<div id="outline-container-org22d75f7" class="outline-3">
<h3 id="org22d75f7"><span class="section-number-3">6.5</span> チケットで指定された訳文番号を探します．</h3>
<div class="outline-text-3" id="text-6-5">
<p>
=&gt;	作業手順（github アカウントがない人）と同じです．
</p>
</div>
</div>
<div id="outline-container-orgb9dab54" class="outline-3">
<h3 id="orgb9dab54"><span class="section-number-3">6.6</span> 翻訳します</h3>
<div class="outline-text-3" id="text-6-6">
<p>
=&gt;	作業手順（github アカウントがない人）と同じです．
</p>
</div>
</div>
<div id="outline-container-org5919adb" class="outline-3">
<h3 id="org5919adb"><span class="section-number-3">6.7</span> 用語集の更新</h3>
<div class="outline-text-3" id="text-6-7">
<p>
=&gt;	作業手順（github アカウントがない人）と同じです．ただし，github ユーザには，用語集を申請する特別なファイルがあります．新しい用語集を申請する時は，MLへの報告以外に，このファイルへ書き込むことでもOKです．メンテナーがプロジェクト全体の用語集に反映します．
</p>

<p>
@hoge がユーザの場合，./glossary/hoge.txt を利用してください．
</p>
</div>
</div>
