docs/howtowork.org
*** 翻訳データを登録します（コンフリクト経験が浅い方）
@<pre>
	 cp org-ja.po tmp/org-ja\_usrname.po
	 git add tmp/org-ja\_usrname.po
	 git commit -m 'ここにどの部分を編集したかのメッセージを書きます．'
	 git push
@</pre>
*** 翻訳データを登録します（自力で何とかできる方）
@<pre>
	 git add org-jp.po
	 git commit -m 'ここにどの部分を編集したかのメッセージを書きます．'
	 git push
@</pre>
**** コンフリクトが発生した場合
   - 今回のテストでは，おそらくヘッダの日付部分でコンフリクトします．
コンフリクトを解消して，コミットし直してください．
  - よく解らないコンフリクトが発生した場合
github で新しいチケットを作り，twitter で報告してください．MLで報告してもかまいません．
  - 以下のコンフリクト解消法も参照してください

http://dl.dropbox.com/u/2440/2011/conflict.html

** github で登録した情報を確認します．
  - 情報を登録すると https://github.com/org-mode-doc-ja/org-ja のトップページに
	自分が登録した情報に対応した commit / tree / parent の3つのリンクが表示されます．
 => commit をクリックして移動するサイトで，差分を確認できるます．
 => 翻訳した部分が正しく反映されているかを確認してください．
*** 登録ミスに気付いた場合
  - 自力で元に戻すかメンテナーに相談してください．
