docs/howtowork.html

<div id="outline-container-org9f19e13" class="outline-3">
<h3 id="org9f19e13"><span class="section-number-3">6.8</span> 翻訳データを登録します</h3>
<div class="outline-text-3" id="text-6-8">
</div>
<div id="outline-container-orgd1e535e" class="outline-4">
<h4 id="orgd1e535e"><span class="section-number-4">6.8.1</span> 翻訳データを登録します（コンフリクト経験が浅い方）</h4>
<div class="outline-text-4" id="text-6-8-1">
<p>
@&lt;pre&gt;
	 cp org-ja.po tmp/org-ja\<sub>usrname.po</sub>
	 git add tmp/org-ja\<sub>usrname.po</sub>
	 git commit -m 'ここにどの部分を編集したかのメッセージを書きます．'
	 git push
@&lt;/pre&gt;
</p>
</div>
</div>
<div id="outline-container-org1f0ef62" class="outline-4">
<h4 id="org1f0ef62"><span class="section-number-4">6.8.2</span> 翻訳データを登録します（自力で何とかできる方）</h4>
<div class="outline-text-4" id="text-6-8-2">
<p>
@&lt;pre&gt;
	 git add org-jp.po
	 git commit -m 'ここにどの部分を編集したかのメッセージを書きます．'
	 git push
@&lt;/pre&gt;
</p>
</div>
<ol class="org-ol">
<li><a id="orgc248e0a"></a>コンフリクトが発生した場合<br />
<div class="outline-text-5" id="text-6-8-2-1">
<ul class="org-ul">
<li>今回のテストでは，おそらくヘッダの日付部分でコンフリクトします．</li>
</ul>
<p>
コンフリクトを解消して，コミットし直してください．
</p>
<ul class="org-ul">
<li>よく解らないコンフリクトが発生した場合</li>
</ul>
<p>
github で新しいチケットを作り，twitter で報告してください．MLで報告してもかまいません．
</p>
<ul class="org-ul">
<li>以下のコンフリクト解消法も参照してください</li>
</ul>

<p>
<a href="http://dl.dropbox.com/u/2440/2011/conflict.html">http://dl.dropbox.com/u/2440/2011/conflict.html</a>
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgaf8e6aa" class="outline-3">
<h3 id="orgaf8e6aa"><span class="section-number-3">6.9</span> github で登録した情報を確認します．</h3>
<div class="outline-text-3" id="text-6-9">
<ul class="org-ul">
<li>情報を登録すると <a href="https://github.com/org-mode-doc-ja/org-ja">https://github.com/org-mode-doc-ja/org-ja</a> のトップページに</li>
</ul>
<p>
 自分が登録した情報に対応した commit / tree / parent の3つのリンクが表示されます．
=&gt; commit をクリックして移動するサイトで，差分を確認できるます．
=&gt; 翻訳した部分が正しく反映されているかを確認してください．
</p>
</div>
<div id="outline-container-org28d0615" class="outline-4">
<h4 id="org28d0615"><span class="section-number-4">6.9.1</span> 登録ミスに気付いた場合</h4>
<div class="outline-text-4" id="text-6-9-1">
<ul class="org-ul">
<li>自力で元に戻すかメンテナーに相談してください．</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Takaaki ISHIKAWA</p>
<p class="date">Created: 2018-10-27 Sat 07:51</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
